### Pandas
- 데이터 분석을 위한 사용이 쉽고 성능이 좋은 오픈소스 python 라이브러리
- R과 Pandas의 특징
    - R보다 Pandas가 학습이 쉽습니다.
    - R보다 Pandas가 성능이 좋습니다.
    - R보다 Python은 활용할 수 있는 분야가 많습니다.
- 크게 두 가지 데이터 타입을 사용합니다.
    - Series : index와 value로 이루어진 데이터 타입
    - DataFrame : index, column, value로 이루어진 데이터 타입

### 1. Series
- 동일한 데이터 타입의 값을 갖습니다.

In [1]:
import numpy as np
import pandas as pd

In [2]:
# Series : value만 설정하면 index는 0부터 자동으로 설정됩니다.
data = pd.Series(np.random.randint(10, size=5))
data

0    3
1    6
2    8
3    1
4    7
dtype: int32

In [4]:
# index 설정
data = pd.Series(np.random.randint(10, size=5),
                index=list("ABCDE"))
data

A    6
B    6
C    7
D    8
E    2
dtype: int32

In [5]:
data.index, data.values

(Index(['A', 'B', 'C', 'D', 'E'], dtype='object'), array([6, 6, 7, 8, 2]))

In [8]:
data["B"], data.B# .숫자 아닌 문자

(6, 6)

In [10]:
data["C"] = 10
data

A     6
B     6
C    10
D     8
E     2
dtype: int32

In [12]:
# 브로드 캐스팅
data * 10

A     60
B     60
C    100
D     80
E     20
dtype: int32

In [13]:
data[["B","E"]]

B    6
E    2
dtype: int32

In [16]:
# offset index
data[2::2]

C    10
E     2
dtype: int32

In [17]:
data[::-1]

E     2
D     8
C    10
B     6
A     6
dtype: int32

In [ ]:
Series 연산

In [18]:
data

A     6
B     6
C    10
D     8
E     2
dtype: int32

In [20]:
data2 = pd.Series({"D":3, "E":5, "F":7})
data2

D    3
E    5
F    7
dtype: int64

In [21]:
result = data + data2
result # None

A     NaN
B     NaN
C     NaN
D    11.0
E     7.0
F     NaN
dtype: float64

In [26]:
result[result.isnull()] = data
result

A     6.0
B     6.0
C    10.0
D    11.0
E     7.0
F     NaN
dtype: float64

In [27]:
result[result.isnull()] = data2
result

A     6.0
B     6.0
C    10.0
D    11.0
E     7.0
F     7.0
dtype: float64

### 2. DataFrame
- 데이터 프레임은 여러개의 Series로 구성
- 같은 컬럼에 있는 value 값은 같은 데이터 타입을 갖습니다.

In [ ]:
# 데이터 프레임 생성 1 : 딕셔너리의 리스트

In [28]:
datas = {
    "name":["dss", "fcamp"],
    "email":["dss@naver.com", "fcamp@daum.net"],
}
datas

{'name': ['dss', 'fcamp'], 'email': ['dss@naver.com', 'fcamp@daum.net']}

In [30]:
df = pd.DataFrame(datas)
df

    name           email
0    dss   dss@naver.com
1  fcamp  fcamp@daum.net

In [ ]:
# 데이터 프레임 생성 2 : 리스트의 딕셔너리

In [31]:
datas = [
    {"name":"dss", "email":"dss@naver.com"},
    {"name":"fcamp", "email":"fcamp@daum.net"}
]
datas

[{'name': 'dss', 'email': 'dss@naver.com'},
 {'name': 'fcamp', 'email': 'fcamp@daum.net'}]

In [34]:
df = pd.DataFrame(datas)
df

    name           email
0    dss   dss@naver.com
1  fcamp  fcamp@daum.net

In [35]:
# 인덱스를 추가하는 방법
df = pd.DataFrame(datas, index=["one", "two"])
df

      name           email
one    dss   dss@naver.com
two  fcamp  fcamp@daum.net

In [36]:
df.index # 클래스 개념 생각

Index(['one', 'two'], dtype='object')

In [37]:
df.columns

Index(['name', 'email'], dtype='object')

In [38]:
df.values

array([['dss', 'dss@naver.com'],
       ['fcamp', 'fcamp@daum.net']], dtype=object)

In [39]:
# 데이터 프레임에서 데이터의 선택 : row, column, (row,column)

In [40]:
# row 선택
df = pd.DataFrame(datas)
df

    name           email
0    dss   dss@naver.com
1  fcamp  fcamp@daum.net

In [42]:
df.loc[1]["email"]

'fcamp@daum.net'

In [43]:
# index가 있으면 수정, 없으면 추가
df.loc[2] = {"name":"andy", "email":"andy@naver.com"}
df

    name           email
0    dss   dss@naver.com
1  fcamp  fcamp@daum.net
2   andy  andy@naver.com

In [44]:
# column 선택

In [46]:
df["name"]

0      dss
1    fcamp
2     andy
Name: name, dtype: object

In [47]:
df["id"] = ""
df

    name           email id
0    dss   dss@naver.com
1  fcamp  fcamp@daum.net
2   andy  andy@naver.com

In [49]:
df["id"] = range(1, 4) # np.arange(1, 4)
df

    name           email  id
0    dss   dss@naver.com   1
1  fcamp  fcamp@daum.net   2
2   andy  andy@naver.com   3

In [50]:
df.dtypes

name     object
email    object
id        int32
dtype: object

In [51]:
# row, column 선택

In [52]:
df.loc[[0, 2],["email","id"]]

            email  id
0   dss@naver.com   1
2  andy@naver.com   3

In [53]:
# 컬럼 데이터 순서 설정

In [54]:
df[["id", "name", "email"]]

   id   name           email
0   1    dss   dss@naver.com
1   2  fcamp  fcamp@daum.net
2   3   andy  andy@naver.com

In [55]:
# head, tail

In [57]:
df.head(2)

    name           email  id
0    dss   dss@naver.com   1
1  fcamp  fcamp@daum.net   2

In [58]:
df.tail(2)

    name           email  id
1  fcamp  fcamp@daum.net   2
2   andy  andy@naver.com   3

### 3. apply 함수
- map 함수와 비슷

In [59]:
# email 컬럼에서 메일의 도메인만 가져와서 새로운 domain 컬럼을 생성
df

    name           email  id
0    dss   dss@naver.com   1
1  fcamp  fcamp@daum.net   2
2   andy  andy@naver.com   3

In [60]:
def domain(email):
    return email.split("@")[1].split(".")[0]

domain(df.loc[0]["email"])

'naver'

In [63]:
df["domain"] = df["email"].apply(domain)
df

    name           email  id domain
0    dss   dss@naver.com   1  naver
1  fcamp  fcamp@daum.net   2   daum
2   andy  andy@naver.com   3  naver

In [64]:
df["domain"] = df["email"].apply(lambda email: email.split("@")[1].split(".")[0])
df

    name           email  id domain
0    dss   dss@naver.com   1  naver
1  fcamp  fcamp@daum.net   2   daum
2   andy  andy@naver.com   3  naver

In [65]:
from makedata import *

In [69]:
get_name()

'Arnold'

In [70]:
get_age()

36

In [82]:
df1 = pd.DataFrame(make_data(5))
df2 = pd.DataFrame(make_data(5))
df2

   Age     Name
0   32     Adam
1   36  Anthony
2   27   Andrew
3   28     Alex
4   39    Alvin

### 4. append

In [84]:
# append 데이터 프레임 합치기
df3 = df1.append(df2)
df3[2:7]

   Age     Name
2   31      Jin
3   30  Anthony
4   35    Alvin
0   32     Adam
1   36  Anthony

In [88]:
# reset_index 인덱스 재정렬
df3.reset_index(drop=True, inplace=True)
df3

   Age     Name
0   34    Alvin
1   38  Anthony
2   31      Jin
3   30  Anthony
4   35    Alvin
5   32     Adam
6   36  Anthony
7   27   Andrew
8   28     Alex
9   39    Alvin

In [90]:
df3 = df1.append(df2, ignore_index=True)
df3

   Age     Name
0   34    Alvin
1   38  Anthony
2   31      Jin
3   30  Anthony
4   35    Alvin
5   32     Adam
6   36  Anthony
7   27   Andrew
8   28     Alex
9   39    Alvin

### 5. concat
- row난 column으로 데이터 프레임을 합칠 때 사용

In [93]:
df3 = pd.concat([df1, df2]).reset_index(drop=True)
df3

   Age     Name
0   34    Alvin
1   38  Anthony
2   31      Jin
3   30  Anthony
4   35    Alvin
5   32     Adam
6   36  Anthony
7   27   Andrew
8   28     Alex
9   39    Alvin

In [94]:
pd.concat([df3, df1], axis=1)

   Age     Name   Age     Name
0   34    Alvin  34.0    Alvin
1   38  Anthony  38.0  Anthony
2   31      Jin  31.0      Jin
3   30  Anthony  30.0  Anthony
4   35    Alvin  35.0    Alvin
5   32     Adam   NaN      NaN
6   36  Anthony   NaN      NaN
7   27   Andrew   NaN      NaN
8   28     Alex   NaN      NaN
9   39    Alvin   NaN      NaN

In [95]:
pd.concat([df3, df1], axis=1, join="inner")

   Age     Name  Age     Name
0   34    Alvin   34    Alvin
1   38  Anthony   38  Anthony
2   31      Jin   31      Jin
3   30  Anthony   30  Anthony
4   35    Alvin   35    Alvin

### 6. group by
- 특정 컬럼의 중복되는 데이터를 합쳐서 새로운 데이터 프레임을 만드는 방법

In [96]:
df = pd.DataFrame(make_data())
df

   Age    Name
0   21    Alex
1   26  Arnold
2   21    Adam
3   34  Anchal
4   35    Alex
5   35    Alex
6   22    Alan
7   25  Arnold
8   30    Alex
9   20     Jin

In [100]:
# size
result_df = df.groupby("Name").size().reset_index(name="count")
result_df

     Name  count
0    Adam      1
1    Alan      1
2    Alex      4
3  Anchal      1
4  Arnold      2
5     Jin      1

In [101]:
# sort_values : 설정한 컬럼으로 데이터 프레임을 정렬

In [104]:
result_df.sort_values(["count"], ascending=False, inplace=True)
result_df.reset_index(drop=True, inplace=True)
result_df

     Name  count
0    Alex      4
1  Arnold      2
2    Adam      1
3    Alan      1
4  Anchal      1
5     Jin      1

In [105]:
# agg()
# size(), min(), max(), mean()

In [109]:
df.groupby("Name").agg("min").reset_index()

     Name  Age
0    Adam   21
1    Alan   22
2    Alex   21
3  Anchal   34
4  Arnold   25
5     Jin   20

In [110]:
# 데이터를 요약해서 보여주는 함수
df.describe()

             Age
count  10.000000
mean   26.900000
std     6.118279
min    20.000000
25%    21.250000
50%    25.500000
75%    33.000000
max    35.000000

In [ ]:
### 7. Merge = sql(join)
- 두 개 이상의 데이터 프레임을 합쳐서 결과를 출력하는 방법